llm/intern_s2_preview/b200/bench/bench_random_mid.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
If tokenization with SMILES formula is of necessity, please 'pip install RDKit' for better tokenization quality.
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31004, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='internlm/Intern-S2-Preview-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/intern_s2_preview/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31004/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31004, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='internlm/Intern-S2-Preview-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/intern_s2_preview/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 12778
#Output tokens: 145
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  5.64      
Total input tokens:                      12778     
Total input text tokens:                 12778     
Total generated tokens:                  145       
Total generated tokens (retokenized):    149       
Request throughput (req/s):              5.68      
Input token throughput (tok/s):          2267.01   
Output token throughput (tok/s):         25.73     
Peak output token throughput (tok/s):    59.00     
Peak concurrent requests:                32        
Total token throughput (tok/s):          2292.73   
Concurrency:                             23.06     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   4062.07   
Median E2E Latency (ms):                 3837.82   
P90 E2E Latency (ms):                    5177.24   
P95 E2E Latency (ms):                    5621.45   
P99 E2E Latency (ms):                    5622.13   
---------------Time to First Token----------------
Mean TTFT (ms):                          2380.02   
Median TTFT (ms):                        2400.16   
P90 TTFT (ms):                           2401.11   
P95 TTFT (ms):                           2401.47   
P99 TTFT (ms):                           2401.77   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          486.57    
Median TPOT (ms):                        470.63    
P90 TPOT (ms):                           509.98    
P95 TPOT (ms):                           543.05    
P99 TPOT (ms):                           653.70    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           476.33    
Median ITL (ms):                         448.53    
P90 ITL (ms):                            543.03    
P95 ITL (ms):                            543.09    
P99 ITL (ms):                            543.27    
Max ITL (ms):                            1190.82   
==================================================